; domain
(define (domain gripper-strips)

    (:predicates (room ?r)
                (ball ?b)
                (gripper ?g)
                (at-robby ?r)
                (at ?b ?r)
                (free ?g)
                (carry ?o ?g)
    )

    (:action move
        :parameters (?from ?to)
        :precondition (and (room ?from)(room ?to)(at-robby ?from))
        :effect (and
            (at-robby ?to)
            (not (at-robby ?from))
        )
    )
    (:action pick
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(at ?obj ?room)(at-robby ?room)(free ?gripper))
        :effect (and
            (carry ?obj ?gripper)
            (not (at ?obj ?room))
            (not (free ?gripper))
        )
    )
    (:action drop
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(carry ?obj ?gripper)(at-robby ?room))
        :effect (and
            (at ?obj ?room)
            (free ?gripper)
            (not (carry ?obj ?gripper))
        )
    )
)

; problem
(define (problem gripper-23)
(:domain gripper-strips)
(:objects rooma roomb room3 room4 left ball1 ball2 ball3 ball4 ball5 ball6 ball7 ball8 ball9 ball10 ball11 ball12 ball13 ball14 ball15 ball16 ball17 ball18 ball19 ball20 ball21 ball22 ball23 )
(:init
(room rooma)
(room roomb)
(room room3)
(room room4)
(gripper left)
(ball ball1)
(ball ball2)
(ball ball3)
(ball ball4)
(ball ball5)
(ball ball6)
(ball ball7)
(ball ball8)
(ball ball9)
(ball ball10)
(ball ball11)
(ball ball12)
(ball ball13)
(ball ball14)
(ball ball15)
(ball ball16)
(ball ball17)
(ball ball18)
(ball ball19)
(ball ball20)
(ball ball21)
(ball ball22)
(ball ball23)
(free left)
(at ball1 rooma)
(at ball2 rooma)
(at ball3 rooma)
(at ball4 roomb)
(at ball5 roomb)
(at ball6 roomb)
(at ball7 roomb)
(at ball8 roomb)
(at ball9 roomb)
(at ball10 roomb)
(at ball11 room3)
(at ball12 room3)
(at ball13 room3)
(at ball14 room3)
(at ball15 room3)
(at ball16 room4)
(at ball17 room4)
(at ball18 room4)
(at ball19 room4)
(at ball20 room4)
(at ball21 room4)
(at ball22 room4)
(at ball23 room4)
(at-robby rooma)
)
(:goal
(and
(at ball1 rooma)
(at ball2 rooma)
(at ball3 rooma)
(at ball4 rooma)
(at ball5 rooma)
(at ball6 rooma)
(at ball7 rooma)
(at ball8 rooma)
(at ball9 rooma)
(at ball10 rooma)
(at ball11 rooma)
(at ball12 rooma)
(at ball13 rooma)
(at ball14 rooma)
(at ball15 rooma)
(at ball16 rooma)
(at ball17 rooma)
(at ball18 rooma)
(at ball19 rooma)
(at ball20 rooma)
(at ball21 rooma)
(at ball22 rooma)
(at ball23 rooma)
)
)
)

; plan
1. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 3 of 23
2. (pick ball9 roomb left)
   deleted: (at ball9 roomb) (free left)
   added: (carry ball9 left)
   goals met: 3 of 23
3. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 3 of 23
4. (drop ball9 rooma left)
   deleted: (carry ball9 left)
   added: (at ball9 rooma) (free left)
   goals met: 4 of 23
5. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 4 of 23
6. (pick ball8 roomb left)
   deleted: (at ball8 roomb) (free left)
   added: (carry ball8 left)
   goals met: 4 of 23
7. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 4 of 23
8. (drop ball8 rooma left)
   deleted: (carry ball8 left)
   added: (at ball8 rooma) (free left)
   goals met: 5 of 23
9. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 5 of 23
10. (pick ball7 roomb left)
   deleted: (at ball7 roomb) (free left)
   added: (carry ball7 left)
   goals met: 5 of 23
11. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 5 of 23
12. (drop ball7 rooma left)
   deleted: (carry ball7 left)
   added: (at ball7 rooma) (free left)
   goals met: 6 of 23
13. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 6 of 23
14. (pick ball6 roomb left)
   deleted: (at ball6 roomb) (free left)
   added: (carry ball6 left)
   goals met: 6 of 23
15. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 6 of 23
16. (drop ball6 rooma left)
   deleted: (carry ball6 left)
   added: (at ball6 rooma) (free left)
   goals met: 7 of 23
17. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 7 of 23
18. (pick ball5 roomb left)
   deleted: (at ball5 roomb) (free left)
   added: (carry ball5 left)
   goals met: 7 of 23
19. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 7 of 23
20. (drop ball5 rooma left)
   deleted: (carry ball5 left)
   added: (at ball5 rooma) (free left)
   goals met: 8 of 23
21. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 8 of 23
22. (pick ball4 roomb left)
   deleted: (at ball4 roomb) (free left)
   added: (carry ball4 left)
   goals met: 8 of 23
23. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 8 of 23
24. (drop ball4 rooma left)
   deleted: (carry ball4 left)
   added: (at ball4 rooma) (free left)
   goals met: 9 of 23
25. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 9 of 23
26. (pick ball10 roomb left)
   deleted: (at ball10 roomb) (free left)
   added: (carry ball10 left)
   goals met: 9 of 23
27. (move roomb room4)
   deleted: (at-robby roomb)
   added: (at-robby room4)
   goals met: 9 of 23
28. (move room4 rooma)
   deleted: (at-robby room4)
   added: (at-robby rooma)
   goals met: 9 of 23
29. (drop ball10 rooma left)
   deleted: (carry ball10 left)
   added: (at ball10 rooma) (free left)
   goals met: 10 of 23
30. (move rooma room4)
   deleted: (at-robby rooma)
   added: (at-robby room4)
   goals met: 10 of 23
31. (pick ball23 room4 left)
   deleted: (at ball23 room4) (free left)
   added: (carry ball23 left)
   goals met: 10 of 23
32. (move room4 rooma)
   deleted: (at-robby room4)
   added: (at-robby rooma)
   goals met: 10 of 23
33. (drop ball23 rooma left)
   deleted: (carry ball23 left)
   added: (at ball23 rooma) (free left)
   goals met: 11 of 23
34. (move rooma room4)
   deleted: (at-robby rooma)
   added: (at-robby room4)
   goals met: 11 of 23
35. (pick ball22 room4 left)
   deleted: (at ball22 room4) (free left)
   added: (carry ball22 left)
   goals met: 11 of 23
36. (move room4 rooma)
   deleted: (at-robby room4)
   added: (at-robby rooma)
   goals met: 11 of 23
37. (drop ball22 rooma left)
   deleted: (carry ball22 left)
   added: (at ball22 rooma) (free left)
   goals met: 12 of 23
38. (move rooma room4)
   deleted: (at-robby rooma)
   added: (at-robby room4)
   goals met: 12 of 23
39. (pick ball21 room4 left)
   deleted: (at ball21 room4) (free left)
   added: (carry ball21 left)
   goals met: 12 of 23
40. (move room4 rooma)
   deleted: (at-robby room4)
   added: (at-robby rooma)
   goals met: 12 of 23
41. (drop ball21 rooma left)
   deleted: (carry ball21 left)
   added: (at ball21 rooma) (free left)
   goals met: 13 of 23
42. (move rooma room4)
   deleted: (at-robby rooma)
   added: (at-robby room4)
   goals met: 13 of 23
43. (pick ball20 room4 left)
   deleted: (at ball20 room4) (free left)
   added: (carry ball20 left)
   goals met: 13 of 23
44. (move room4 rooma)
   deleted: (at-robby room4)
   added: (at-robby rooma)
   goals met: 13 of 23
45. (drop ball20 rooma left)
   deleted: (carry ball20 left)
   added: (at ball20 rooma) (free left)
   goals met: 14 of 23
46. (move rooma room4)
   deleted: (at-robby rooma)
   added: (at-robby room4)
   goals met: 14 of 23
47. (pick ball19 room4 left)
   deleted: (at ball19 room4) (free left)
   added: (carry ball19 left)
   goals met: 14 of 23
48. (move room4 rooma)
   deleted: (at-robby room4)
   added: (at-robby rooma)
   goals met: 14 of 23
49. (drop ball19 rooma left)
   deleted: (carry ball19 left)
   added: (at ball19 rooma) (free left)
   goals met: 15 of 23
50. (move rooma room4)
   deleted: (at-robby rooma)
   added: (at-robby room4)
   goals met: 15 of 23
51. (pick ball18 room4 left)
   deleted: (at ball18 room4) (free left)
   added: (carry ball18 left)
   goals met: 15 of 23
52. (move room4 rooma)
   deleted: (at-robby room4)
   added: (at-robby rooma)
   goals met: 15 of 23
53. (drop ball18 rooma left)
   deleted: (carry ball18 left)
   added: (at ball18 rooma) (free left)
   goals met: 16 of 23
54. (move rooma room4)
   deleted: (at-robby rooma)
   added: (at-robby room4)
   goals met: 16 of 23
55. (pick ball17 room4 left)
   deleted: (at ball17 room4) (free left)
   added: (carry ball17 left)
   goals met: 16 of 23
56. (move room4 rooma)
   deleted: (at-robby room4)
   added: (at-robby rooma)
   goals met: 16 of 23
57. (drop ball17 rooma left)
   deleted: (carry ball17 left)
   added: (at ball17 rooma) (free left)
   goals met: 17 of 23
58. (move rooma room4)
   deleted: (at-robby rooma)
   added: (at-robby room4)
   goals met: 17 of 23
59. (pick ball16 room4 left)
   deleted: (at ball16 room4) (free left)
   added: (carry ball16 left)
   goals met: 17 of 23
60. (move room4 room3)
   deleted: (at-robby room4)
   added: (at-robby room3)
   goals met: 17 of 23
61. (move room3 rooma)
   deleted: (at-robby room3)
   added: (at-robby rooma)
   goals met: 17 of 23
62. (drop ball16 rooma left)
   deleted: (carry ball16 left)
   added: (at ball16 rooma) (free left)
   goals met: 18 of 23
63. (move rooma room3)
   deleted: (at-robby rooma)
   added: (at-robby room3)
   goals met: 18 of 23
64. (pick ball15 room3 left)
   deleted: (at ball15 room3) (free left)
   added: (carry ball15 left)
   goals met: 18 of 23
65. (move room3 rooma)
   deleted: (at-robby room3)
   added: (at-robby rooma)
   goals met: 18 of 23
66. (drop ball15 rooma left)
   deleted: (carry ball15 left)
   added: (at ball15 rooma) (free left)
   goals met: 19 of 23
67. (move rooma room3)
   deleted: (at-robby rooma)
   added: (at-robby room3)
   goals met: 19 of 23
68. (pick ball14 room3 left)
   deleted: (at ball14 room3) (free left)
   added: (carry ball14 left)
   goals met: 19 of 23
69. (move room3 rooma)
   deleted: (at-robby room3)
   added: (at-robby rooma)
   goals met: 19 of 23
70. (drop ball14 rooma left)
   deleted: (carry ball14 left)
   added: (at ball14 rooma) (free left)
   goals met: 20 of 23
71. (move rooma room3)
   deleted: (at-robby rooma)
   added: (at-robby room3)
   goals met: 20 of 23
72. (pick ball13 room3 left)
   deleted: (at ball13 room3) (free left)
   added: (carry ball13 left)
   goals met: 20 of 23
73. (move room3 rooma)
   deleted: (at-robby room3)
   added: (at-robby rooma)
   goals met: 20 of 23
74. (drop ball13 rooma left)
   deleted: (carry ball13 left)
   added: (at ball13 rooma) (free left)
   goals met: 21 of 23
75. (move rooma room3)
   deleted: (at-robby rooma)
   added: (at-robby room3)
   goals met: 21 of 23
76. (pick ball12 room3 left)
   deleted: (at ball12 room3) (free left)
   added: (carry ball12 left)
   goals met: 21 of 23
77. (move room3 rooma)
   deleted: (at-robby room3)
   added: (at-robby rooma)
   goals met: 21 of 23
78. (drop ball12 rooma left)
   deleted: (carry ball12 left)
   added: (at ball12 rooma) (free left)
   goals met: 22 of 23
79. (move rooma room3)
   deleted: (at-robby rooma)
   added: (at-robby room3)
   goals met: 22 of 23
80. (pick ball11 room3 left)
   deleted: (at ball11 room3) (free left)
   added: (carry ball11 left)
   goals met: 22 of 23
81. (move room3 rooma)
   deleted: (at-robby room3)
   added: (at-robby rooma)
   goals met: 22 of 23
82. (drop ball11 rooma left)
   deleted: (carry ball11 left)
   added: (at ball11 rooma) (free left)
   goals met: 23 of 23
